In [2]:
import pandas as pd

In [3]:
pd.Series([1,2,3,4,5,6])

0    1
1    2
2    3
3    4
4    5
5    6
dtype: int64

In [4]:
seri = pd.Series(["ankara","istanbul","izmir","antalya","bursa"])

In [5]:
seri

0      ankara
1    istanbul
2       izmir
3     antalya
4       bursa
dtype: object

In [6]:
list = [1,2,3,4,5,6]

In [7]:
seri = pd.Series(list)

In [8]:
seri

0    1
1    2
2    3
3    4
4    5
5    6
dtype: int64

In [9]:
import numpy as np 
a=np.arange(1,6)

In [10]:
seri = pd.Series(a)

In [11]:
seri

0    1
1    2
2    3
3    4
4    5
dtype: int32

In [12]:
seri = pd.Series([1,2,3,4,5,6])

In [13]:
type(seri)

pandas.core.series.Series

In [14]:
seri.axes

[RangeIndex(start=0, stop=6, step=1)]

In [15]:
seri.ndim

1

In [16]:
seri.size

6

In [17]:
seri.shape

(6,)

In [18]:
seri.values

array([1, 2, 3, 4, 5, 6], dtype=int64)

In [19]:
seri.head(2)

0    1
1    2
dtype: int64

In [20]:
seri.tail(3)

3    4
4    5
5    6
dtype: int64

In [21]:
seri.head()

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [22]:
seri = pd.Series([1,2,3,4,5,6])

In [23]:
seri[0]

1

In [24]:
seri[3]

4

In [25]:
seri = pd.Series((1,2,3,4,5),index=(0,2,4,6,8))

In [26]:
seri

0    1
2    2
4    3
6    4
8    5
dtype: int64

In [27]:
seri = pd.Series((1,2,3,4,5),index=("a","b","c","d","e"))

In [28]:
seri

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [29]:
seri["b"]

2

In [30]:
seri[0]

1

In [31]:
seri[2]

3

In [32]:
seri = pd.Series((1,2,3,4,5),index=(10,20,30,40,50))

In [33]:
#seri[1]

In [34]:
sozluk = {"a":1,"b":2,"c":3,"d":4,"e":5}

In [35]:
sozluk

{'a': 1, 'b': 2, 'c': 3, 'd': 4, 'e': 5}

In [36]:
seri = pd.Series(sozluk)

In [37]:
seri

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [38]:
seri["a"]

1

In [39]:
seri = pd.Series([1,2,3,4,5,6])

In [40]:
seri.values

array([1, 2, 3, 4, 5, 6], dtype=int64)

In [41]:
seri.index

RangeIndex(start=0, stop=6, step=1)

In [42]:
seri.items

<bound method Series.items of 0    1
1    2
2    3
3    4
4    5
5    6
dtype: int64>

In [43]:
a = pd.Series([1,2,3,4,5,6])

In [44]:
a

0    1
1    2
2    3
3    4
4    5
5    6
dtype: int64

In [45]:
a[0:3]

0    1
1    2
2    3
dtype: int64

In [46]:
a.index = (10,20,30,40,50,60)

In [47]:
a[10:50]

Series([], dtype: int64)

In [48]:
a.index=("a","b","c","d","e","f")

In [49]:
a["a":"d"]

a    1
b    2
c    3
d    4
dtype: int64

In [50]:
a[0:3]

a    1
b    2
c    3
dtype: int64

In [51]:
seri1 = pd.Series((1,2,3,4),index=("a","b","c","d"))

In [52]:
seri2 = pd.Series((5,6,7,8),index=("e","f","g","f"))

In [53]:
pd.concat([seri1,seri2])

a    1
b    2
c    3
d    4
e    5
f    6
g    7
f    8
dtype: int64

In [54]:
seri1.append(seri2)

C:\Users\ASUS\AppData\Local\Temp\ipykernel_21288\2966266472.py:1: FutureWarning: The series.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  seri1.append(seri2)

a    1
b    2
c    3
d    4
e    5
f    6
g    7
f    8
dtype: int64

In [55]:
seri1 = pd.Series((1,2,3,4),index=("a","b","c","d"))

In [56]:
"a" in seri1

True

In [57]:
"e" in seri1

False

In [58]:
seri1["a"]=5

In [59]:
seri1

a    5
b    2
c    3
d    4
dtype: int64

In [60]:
seri[0]

1

In [61]:
seri[1]

2

In [62]:
seri[0:3]

0    1
1    2
2    3
dtype: int64

In [63]:
seri2=pd.Series((1,2,3,4),index = (10,20,30,40))

In [64]:
seri2[10]

1

In [65]:
seri2[10:30]

Series([], dtype: int64)

In [66]:
seri2[0:2]

10    1
20    2
dtype: int64

In [67]:
seri2 = pd.Series((1,2,3,4),  index = (10,20,30,40))

In [68]:
seri2.loc[10]

1

seri2[10]

In [69]:
seri2[10:30]

Series([], dtype: int64)

In [70]:
# loc -> etiket isimleri ile seçim yapar
# 
seri2.loc[10:30]

10    1
20    2
30    3
dtype: int64

In [71]:
seri2.loc[10:90]

10    1
20    2
30    3
40    4
dtype: int64

In [72]:
seri2 = pd.Series((1,2,3,4), index = (10,20,30,40))

In [73]:
# iloc -> index numaraları ile seçim yapar
# iloc pandas kütüphanesinde bir DataFrame üzerinde satır ve sütun seçimi yapmak için kullanılan bir indeksleme yöntemidir. 
# iloc indeks numaralarına dayalı olarak seçim yapar.
seri2.iloc[0:2]

10    1
20    2
dtype: int64

In [74]:
seri2[0:2]

10    1
20    2
dtype: int64

In [75]:
seri1 = pd.Series((10,20,30,40,50,60))

In [76]:
seri1 > 30

0    False
1    False
2    False
3     True
4     True
5     True
dtype: bool

In [77]:
seri1[seri1>30]

3    40
4    50
5    60
dtype: int64

In [78]:
seri1[(seri1>15)&(seri1<45)]

1    20
2    30
3    40
dtype: int64

In [79]:
seri = pd.Series((1,2,3,4))

In [80]:
seri+5

0    6
1    7
2    8
3    9
dtype: int64

In [81]:
seri*2

0    2
1    4
2    6
3    8
dtype: int64

In [82]:
seri1=pd.Series([4,2,6,8,5],index=("elma","armut","üzüm","çilek","erik"))
seri2=pd.Series([5,6,1,3,7],index=("üzüm","elma","armut","erik","çilek"))

In [83]:
seri1 + seri2

armut     3
elma     10
erik      8
çilek    15
üzüm     11
dtype: int64

In [84]:
seri1=pd.Series([4,2,6,8,5],index=("elma","armut","üzüm","çilek","erik"))
seri2=pd.Series([5,6,1,3,7],index=("elma","armut","üzüm","çilek","kaysı"))

In [85]:
seri1 + seri2

armut     8.0
elma      9.0
erik      NaN
kaysı     NaN
çilek    11.0
üzüm      7.0
dtype: float64

In [86]:
#Özel Metodlar

In [87]:
seri1 = pd.Series([1,2,3,4,5,6,7,8])

In [88]:
seri1.sum()

36

In [89]:
seri1.max()

8

In [90]:
seri1.min()

1

In [91]:
seri1.mean()

4.5

In [92]:
data = pd.read_csv("titanic.csv")

In [93]:
data.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [94]:
data.head(8)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S

In [95]:
data.tail()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.00,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.00,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q

In [96]:
len(data)

891

In [97]:
#Dataframe özellikleri
pd.DataFrame([1,2,3,4,5,6])

   0
0  1
1  2
2  3
3  4
4  5
5  6

In [98]:
pd.DataFrame([1,2,3,4,5,6],columns=["degisken_ismi"])

   degisken_ismi
0              1
1              2
2              3
3              4
4              5
5              6

In [99]:
data1 = pd.DataFrame([1,2,3,4,5,6],columns=["degisken_ismi"])
type(data1) #dataframe oluşturduk ve tipini sorguladık

pandas.core.frame.DataFrame

In [100]:
data1.axes #index bilgilerini verir

[RangeIndex(start=0, stop=6, step=1), Index(['degisken_ismi'], dtype='object')]

In [101]:
pd.DataFrame([1,2,3,4,5,6],columns=["degisken_ismi"],index=["a","b","c","d","e","f"])   #index isimlerini değiştirdik

   degisken_ismi
a              1
b              2
c              3
d              4
e              5
f              6

In [102]:
data1.ndim #boyut bilgisi

2

In [103]:
data1.shape #satır ve sütun bilgisi

(6, 1)

In [104]:
data1.size #eleman sayısı

6

In [105]:
list = [1,2,3,4,5,6]
pd.DataFrame(list,columns=["degisken_ismi"],index=["a","b","c","d","e","f"])

   degisken_ismi
a              1
b              2
c              3
d              4
e              5
f              6

In [106]:
a = np.array([1,2,3,4,5,6]) #numpy arrayi oluşturduk ve dataframe e çevirdik
pd.DataFrame(a,columns=["degisken_ismi"],index=["a","b","c","d","e","f"])

   degisken_ismi
a              1
b              2
c              3
d              4
e              5
f              6

In [107]:
b = np.arange(1,16).reshape(5,3) #5 satır 3 sütunluk bir matris oluşturduk
pd.DataFrame(b,columns=["var1","var2","var3"],index=["a","b","c","d","e"]) #matrisi dataframe e çevirdik

   var1  var2  var3
a     1     2     3
b     4     5     6
c     7     8     9
d    10    11    12
e    13    14    15

In [108]:
data1 = pd.Series([1,2,3,4,5,6],index=["a","b","c","d","e","f"])
pd.DataFrame(data1,columns=["degisken_ismi"]) #seriyi dataframe e çevirdik

   degisken_ismi
a              1
b              2
c              3
d              4
e              5
f              6

In [109]:
data1 = pd.Series([1,2,3,4,5,6],index=["a","b","c","d","e","f"])
data2 = pd.Series([7,8,9,10,11,12],index=["a","b","c","d","e","f"])
pd.DataFrame({"degisken1":data1,"degisken2":data2}) #serileri dataframe e çevirdik

   degisken1  degisken2
a          1          7
b          2          8
c          3          9
d          4         10
e          5         11
f          6         12

In [110]:
data = {"column1":{"line1":1,"line2":2,"line3":3},"column2":{"line1":4,"line2":5,"line3":6},"column3":{"line1":7,"line2":8,"line3":9}}
pd.DataFrame(data) #sözlükten dataframe oluşturduk

       column1  column2  column3
line1        1        4        7
line2        2        5        8
line3        3        6        9

In [111]:
a = np.arange(1,16).reshape(5,3)    #5 satır 3 sütunluk bir matris oluşturduk
df = pd.DataFrame(a,columns=["var1","var2","var3"]) #matrisi dataframe e çevirdik
df

   var1  var2  var3
0     1     2     3
1     4     5     6
2     7     8     9
3    10    11    12
4    13    14    15

In [112]:
x = df["var1"] #var1 değişkenini x e atadık
x

0     1
1     4
2     7
3    10
4    13
Name: var1, dtype: int32

In [113]:
type(x) #x in tipini sorguladık

pandas.core.series.Series

In [114]:
x  = df[["var1","var2"]] #var1 ve var2 değişkenlerini x e atadık
x

   var1  var2
0     1     2
1     4     5
2     7     8
3    10    11
4    13    14

In [115]:
type(x) #x in tipini sorguladık artık dataframe tipine dönüştü

pandas.core.frame.DataFrame

In [116]:
data = pd.DataFrame([1,2,3,4,5,6],columns=["degisken_ismi"],index=["a","b","c","d","e","f"])

In [117]:
data.index #index bilgilerini verir

Index(['a', 'b', 'c', 'd', 'e', 'f'], dtype='object')

In [118]:
data.columns #sütun bilgilerini verir

Index(['degisken_ismi'], dtype='object')

In [119]:
data=pd.DataFrame([1,2,3,4,5,6],columns=["degisken_ismi"],index=["a","b","c","d","e","f"])
data #satır ve sütün isimlerini değiştirdik

   degisken_ismi
a              1
b              2
c              3
d              4
e              5
f              6

In [120]:
data.columns=("degisken1",) #sütun ismini değiştirdik
data

   degisken1
a          1
b          2
c          3
d          4
e          5
f          6

In [121]:
data.index=("x","y","z","t","u","v") #satır isimlerini değiştirdik
data

   degisken1
x          1
y          2
z          3
t          4
u          5
v          6

In [122]:
a = np.random.randint(10,size=6)
b = np.random.randint(10,size=6)
c = np.random.randint(10,size=6)
data = pd.DataFrame({"s1":a,"s2":b,"s3":c})
data

   s1  s2  s3
0   4   6   8
1   6   6   6
2   8   9   7
3   6   1   8
4   9   7   0
5   4   0   0

In [123]:
data[0:1] #ilk satırı getirir

   s1  s2  s3
0   4   6   8

In [124]:
data[1:4] #1. satırdan 4. satıra kadar getirir

   s1  s2  s3
1   6   6   6
2   8   9   7
3   6   1   8

In [125]:
data.index = (10,20,30,40,50,60) #index isimlerini değiştirdik
data

    s1  s2  s3
10   4   6   8
20   6   6   6
30   8   9   7
40   6   1   8
50   9   7   0
60   4   0   0

In [126]:
data.loc[20] #20. indexi getirir

s1    6
s2    6
s3    6
Name: 20, dtype: int32

In [127]:
data.iloc[1] #1. indexi getirir

s1    6
s2    6
s3    6
Name: 20, dtype: int32

In [128]:
data.index=(1,2,3,4,5,6) #index isimlerini değiştirdik
data.drop(2,axis=0) #2. satırı siler

   s1  s2  s3
1   4   6   8
3   8   9   7
4   6   1   8
5   9   7   0
6   4   0   0

In [129]:
data.drop("s2",axis=1) #s2 sütununu siler

   s1  s3
1   4   8
2   6   6
3   8   7
4   6   8
5   9   0
6   4   0

In [130]:
a=[1,2,3]
data.drop(a,axis=0) #1,2,3. satırları siler

   s1  s2  s3
4   6   1   8
5   9   7   0
6   4   0   0

In [131]:

a =["s2","s3"]
data.drop(a,axis=1) #s2 ve s3 sütunlarını siler

   s1
1   4
2   6
3   8
4   6
5   9
6   4

In [132]:
data

   s1  s2  s3
1   4   6   8
2   6   6   6
3   8   9   7
4   6   1   8
5   9   7   0
6   4   0   0

In [133]:
data.drop("s2",axis=1,inplace=True) #s2 sütununu siler ve kalıcı hale getirir, inplace görevi yapar ve kalıcı hale getirir 
data

   s1  s3
1   4   8
2   6   6
3   8   7
4   6   8
5   9   0
6   4   0

In [134]:
data = {"sütun1":{"satır1":1,"satır2":2,"satır3":3},"sütun2":{"satır1":4,"satır2":5,"satır3":6},"sütun3":{"satır1":7,"satır2":8,"satır3":9}}
df = pd.DataFrame(data)
df["sütun1"] #sütun1 i getirir

satır1    1
satır2    2
satır3    3
Name: sütun1, dtype: int64

In [135]:
df.sütun1 #sütun1 i getirir

satır1    1
satır2    2
satır3    3
Name: sütun1, dtype: int64

In [136]:
df[["sütun1","sütun2"]] #sütun1 ve sütun2 yi getirir

        sütun1  sütun2
satır1       1       4
satır2       2       5
satır3       3       6

In [137]:
df["sütun4"] = 10,11,12 #sütun4 ü oluşturduk ve değerlerini atadık
df

        sütun1  sütun2  sütun3  sütun4
satır1       1       4       7      10
satır2       2       5       8      11
satır3       3       6       9      12

In [138]:
df["sütun5"] = df["sütun1"] + df["sütun2"] #sütun5 i oluşturduk ve sütun1 ve sütun2 nin toplamını atadık
df

        sütun1  sütun2  sütun3  sütun4  sütun5
satır1       1       4       7      10       5
satır2       2       5       8      11       7
satır3       3       6       9      12       9

In [139]:
#Satır ve sütunlara birlikte erişmek
a = np.random.randint(10,size=6)
b = np.random.randint(10,size=6)
c = np.random.randint(10,size=6)
d = np.random.randint(10,size=6)
data = pd.DataFrame({"s1":a,"s2":b,"s3":c,"s4":d})
data[0:2]

   s1  s2  s3  s4
0   6   7   3   2
1   5   7   9   1

In [140]:
data[["s1","s2"]]

   s1  s2
0   6   7
1   5   7
2   0   7
3   1   2
4   1   0
5   5   9

In [141]:
data.loc[0:2,"s1":"s3"] #0. satırdan 2. satıra kadar s1 den s3 e kadar getirir

   s1  s2  s3
0   6   7   3
1   5   7   9
2   0   7   9

In [142]:
data.iloc[0:2,0:3] #0. satırdan 2. satıra kadar ve 0. sütundan 3. sütuna kadar getirir

   s1  s2  s3
0   6   7   3
1   5   7   9

In [143]:
#satırlara ve sütunlara aynı anda erişmek için iloc ve loc ifadesi kullanmak zorundayız
data

   s1  s2  s3  s4
0   6   7   3   2
1   5   7   9   1
2   0   7   9   3
3   1   2   8   4
4   1   0   1   7
5   5   9   1   2

In [144]:
data.loc[2,"s2"] #dilimleme işlemi yapmadan 2. satır ve s2 sütununu getirir

7

In [145]:
#DataFramlerde koşullu işlemler
data > 5 #dataframe deki değerler 5 ten büyük mü diye sorguladık

      s1     s2     s3     s4
0   True   True  False  False
1  False   True   True  False
2  False   True   True  False
3  False  False   True  False
4  False  False  False   True
5  False   True  False  False

In [146]:
data[data>5] #dataframe deki değerler 5 ten büyük olanları getirir

    s1   s2   s3   s4
0  6.0  7.0  NaN  NaN
1  NaN  7.0  9.0  NaN
2  NaN  7.0  9.0  NaN
3  NaN  NaN  8.0  NaN
4  NaN  NaN  NaN  7.0
5  NaN  9.0  NaN  NaN

In [147]:
data

   s1  s2  s3  s4
0   6   7   3   2
1   5   7   9   1
2   0   7   9   3
3   1   2   8   4
4   1   0   1   7
5   5   9   1   2

In [148]:
data[data.s2>5] #s2 sütunundaki değerler 5 ten büyük olanları getirir

   s1  s2  s3  s4
0   6   7   3   2
1   5   7   9   1
2   0   7   9   3
5   5   9   1   2

In [149]:
data[data["s2"]>5] #s2 deki değerler 5 ten büyük olanları getirir

   s1  s2  s3  s4
0   6   7   3   2
1   5   7   9   1
2   0   7   9   3
5   5   9   1   2

In [150]:
data[data.s2>5]["s3"] #s2 deki değerler 5 ten büyük olanların s3 sütununu getirir

0    3
1    9
2    9
5    1
Name: s3, dtype: int32

In [151]:
#Eksik verilerin Tamamlanması
a=np.array([[7,np.nan,12],[np.nan,np.nan,5],[np.nan,15,9]])
data=pd.DataFrame(a,index=["satır1","satır2","satır3"],columns=["sütun1","sütun2","sütun3"])    
data

        sütun1  sütun2  sütun3
satır1     7.0     NaN    12.0
satır2     NaN     NaN     5.0
satır3     NaN    15.0     9.0

In [152]:
data.fillna(value=0) #eksik verileri 0 ile doldurduk

        sütun1  sütun2  sütun3
satır1     7.0     0.0    12.0
satır2     0.0     0.0     5.0
satır3     0.0    15.0     9.0

In [153]:
data.sum() #sütunların toplamını verir

sütun1     7.0
sütun2    15.0
sütun3    26.0
dtype: float64

In [154]:
data.sum().sum() #dataframe deki tüm değerlerin toplamını verir

48.0

In [155]:
data.size #dataframe deki tüm değerlerin sayısını verir

9

In [156]:
data.isnull().sum().sum() #eksik verilerin sayısını verir

4

In [157]:
data

        sütun1  sütun2  sütun3
satır1     7.0     NaN    12.0
satır2     NaN     NaN     5.0
satır3     NaN    15.0     9.0

In [158]:
ort = (data.sum().sum())/(data.size-data.isnull().sum().sum())  #eksik verileri ortalama ile doldurduk
ort

9.6

In [159]:
data.fillna(value=ort) #eksik verileri ortalama ile doldurduk

        sütun1  sütun2  sütun3
satır1     7.0     9.6    12.0
satır2     9.6     9.6     5.0
satır3     9.6    15.0     9.0

In [160]:
#DataFrameleri Birleştirme İşlemleleri
a=np.random.randint(10,size=5)
b=np.random.randint(10,size=5)
c=np.random.randint(10,size=5)
data1=pd.DataFrame({"s1":a,"s2":b,"s3":c})
data1

   s1  s2  s3
0   9   8   2
1   0   2   4
2   1   2   8
3   2   3   3
4   5   3   8

In [161]:
data2 = data1 +10 #data1 in değerlerine 10 ekledik
data2

   s1  s2  s3
0  19  18  12
1  10  12  14
2  11  12  18
3  12  13  13
4  15  13  18

In [162]:
pd.concat([data1,data2]) #data1 ve data2 yi birleştirdik

   s1  s2  s3
0   9   8   2
1   0   2   4
2   1   2   8
3   2   3   3
4   5   3   8
0  19  18  12
1  10  12  14
2  11  12  18
3  12  13  13
4  15  13  18

In [163]:
pd.concat([data1,data2],ignore_index=True) #data1 ve data2 yi birleştirdik ve indexleri sıfırladık

   s1  s2  s3
0   9   8   2
1   0   2   4
2   1   2   8
3   2   3   3
4   5   3   8
5  19  18  12
6  10  12  14
7  11  12  18
8  12  13  13
9  15  13  18

In [164]:
pd.concat([data1,data2],axis=1) #data1 ve data2 yi sütun bazında birleştirdik

   s1  s2  s3  s1  s2  s3
0   9   8   2  19  18  12
1   0   2   4  10  12  14
2   1   2   8  11  12  18
3   2   3   3  12  13  13
4   5   3   8  15  13  18

In [165]:
data2.columns=["s1","s2","veri"] #data2 nin sütun isimlerini değiştirdik
pd.concat([data1,data2],axis=0) #data1 ve data2 yi sütun bazında birleştirdik

   s1  s2   s3  veri
0   9   8  2.0   NaN
1   0   2  4.0   NaN
2   1   2  8.0   NaN
3   2   3  3.0   NaN
4   5   3  8.0   NaN
0  19  18  NaN  12.0
1  10  12  NaN  14.0
2  11  12  NaN  18.0
3  12  13  NaN  13.0
4  15  13  NaN  18.0

In [166]:
data2.columns=["s1","s2","veri"] #data2 nin sütun isimlerini değiştirdik
pd.concat([data1,data2],join="inner") #data1 ve data2 yi sütun bazında birleştirdik ve ortak olan sütunları getirdik

   s1  s2
0   9   8
1   0   2
2   1   2
3   2   3
4   5   3
0  19  18
1  10  12
2  11  12
3  12  13
4  15  13

In [167]:
#Join Metodu ile Birleştirme İşlemleri  
data1 = {"A": ["A1","A2","A3","A4"],
         "B": ["B1","B2","B3","B4"]}
df1 = pd.DataFrame(data1)
df1 #dataframe oluşturduk

    A   B
0  A1  B1
1  A2  B2
2  A3  B3
3  A4  B4

In [168]:
data2 = {"C": ["C1","C2","C3"],
         "D": ["D1","D2","D3"]}
df2 = pd.DataFrame(data2)
df2 #dataframe oluşturduk

    C   D
0  C1  D1
1  C2  D2
2  C3  D3

In [169]:
df1.join(df2) #df1 ve df2 yi birleştirdik

    A   B    C    D
0  A1  B1   C1   D1
1  A2  B2   C2   D2
2  A3  B3   C3   D3
3  A4  B4  NaN  NaN

In [170]:
df2.join(df1) #df2 ve df1 i birleştirdik

    C   D   A   B
0  C1  D1  A1  B1
1  C2  D2  A2  B2
2  C3  D3  A3  B3

In [171]:
#Merge Metodu ile Birleştirme İşlemleri 
data1=pd.DataFrame({"A":["A1","A2","A3","A4"],
                "B":["B1","B2","B3","B4"],
                   "ortak":["K1","K2","K3","K4"]})
data2=pd.DataFrame({"C":["C1","C2","C3"],
                "D":["D1","D2","D3"],
                   "ortak":["K3","K4","K5"]})
data1

    A   B ortak
0  A1  B1    K1
1  A2  B2    K2
2  A3  B3    K3
3  A4  B4    K4

In [172]:
data2

    C   D ortak
0  C1  D1    K3
1  C2  D2    K4
2  C3  D3    K5

In [173]:
pd.merge(data1,data2)

    A   B ortak   C   D
0  A3  B3    K3  C1  D1
1  A4  B4    K4  C2  D2

In [174]:
data=pd.read_csv("titanic.csv")
data.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [175]:
data.shape

(891, 12)

In [176]:
data.count()

PassengerId    891
Survived       891
Pclass         891
Name           891
Sex            891
Age            714
SibSp          891
Parch          891
Ticket         891
Fare           891
Cabin          204
Embarked       889
dtype: int64

In [177]:
data["Name"].count() #Name sütunundaki değerlerin sayısını verir

891

In [178]:
data.sum() #sütunların toplamını verir

C:\Users\ASUS\AppData\Local\Temp\ipykernel_21288\220773503.py:1: FutureWarning: The default value of numeric_only in DataFrame.sum is deprecated. In a future version, it will default to False. In addition, specifying 'numeric_only=None' is deprecated. Select only valid columns or specify the value of numeric_only to silence this warning.
  data.sum() #sütunların toplamını verir

PassengerId                                               397386
Survived                                                     342
Pclass                                                      2057
Name           Braund, Mr. Owen HarrisCumings, Mrs. John Brad...
Sex            malefemalefemalefemalemalemalemalemalefemalefe...
Age                                                     21205.17
SibSp                                                        466
Parch                                                        340
Ticket         A/5 21171PC 17599STON/O2. 31012821138033734503...
Fare                                                  28693.9493
dtype: object

In [179]:
data.mean() #sütunların ortalamasını verir

C:\Users\ASUS\AppData\Local\Temp\ipykernel_21288\2114110365.py:1: FutureWarning: The default value of numeric_only in DataFrame.mean is deprecated. In a future version, it will default to False. In addition, specifying 'numeric_only=None' is deprecated. Select only valid columns or specify the value of numeric_only to silence this warning.
  data.mean() #sütunların ortalamasını verir

PassengerId    446.000000
Survived         0.383838
Pclass           2.308642
Age             29.699118
SibSp            0.523008
Parch            0.381594
Fare            32.204208
dtype: float64

In [180]:
data.describe() #sütunların istatistiksel bilgilerini verir

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [181]:
#GroupBy işlemleri
data=pd.DataFrame({"takım":["galatasaray","fenerbahçe","fenerbahçe","galatasaray","beşiktaş"],
                  "maaş":[5000,3000,8000,4000,7000]})
data

         takım  maaş
0  galatasaray  5000
1   fenerbahçe  3000
2   fenerbahçe  8000
3  galatasaray  4000
4     beşiktaş  7000

In [182]:
group = data.groupby("takım") #takımlara göre grupladık 
group

In [183]:
group.sum() #takımlara göre grupladık ve toplamlarını aldık

              maaş
takım
beşiktaş      7000
fenerbahçe   11000
galatasaray   9000

In [184]:
group.mean() #takımlara göre grupladık ve ortalamalarını aldık

               maaş
takım
beşiktaş     7000.0
fenerbahçe   5500.0
galatasaray  4500.0

In [185]:
data.groupby("takım").sum().loc["fenerbahçe"] #takımlara göre grupladık ve toplamlarını aldık ve fenerbahçe nin maaş toplamını aldık

maaş    11000
Name: fenerbahçe, dtype: int64

In [186]:
group.count() #takımlara göre grupladık ve sayılarını aldık

             maaş
takım
beşiktaş        1
fenerbahçe      2
galatasaray     2

In [187]:
data.groupby("takım").min() #takımlara göre grupladık ve min değerlerini aldık

             maaş
takım
beşiktaş     7000
fenerbahçe   3000
galatasaray  4000

In [188]:
data.groupby("takım").min()["maaş"]["galatasaray"] #takımlara göre grupladık ve min değerlerini aldık ve galatasaray ın maaş min değerini aldık

4000

In [189]:
data.groupby("takım").mean() #takımlara göre grupladık ve ortalamalarını aldık

               maaş
takım
beşiktaş     7000.0
fenerbahçe   5500.0
galatasaray  4500.0

In [190]:
#Özel Fonksiyonlar
df=pd.DataFrame({
    "sütun1":[1,2,3,4,5,6],
    "sütun2":[10,20,30,10,20,10],
    "sütun3":["ali","veli","ayşe","fatma","emre","büşra"]})
df

   sütun1  sütun2 sütun3
0       1      10    ali
1       2      20   veli
2       3      30   ayşe
3       4      10  fatma
4       5      20   emre
5       6      10  büşra

In [191]:
df.head()

   sütun1  sütun2 sütun3
0       1      10    ali
1       2      20   veli
2       3      30   ayşe
3       4      10  fatma
4       5      20   emre

In [192]:
df["sütun2"].unique() #sütun2 deki değerleri teke düşürdük

array([10, 20, 30], dtype=int64)

In [193]:
df["sütun2"].nunique() #sütun2 deki değerlerin sayısını verir

3

In [194]:
df["sütun2"].value_counts() #sütun2 deki değerlerin sayısını verir

10    3
20    2
30    1
Name: sütun2, dtype: int64

In [195]:
#Pivot Tablolar
data=pd.DataFrame({"Aylar":["Haziran","Temmuz","Ağustos","Haziran","Temmuz","Ağustos","Haziran","Temmuz","Ağustos"],
                   "Sıcaklık":[30,34,35,28,32,34,29,35,36],
                   "Şehirler":["İstanbul","İstanbul","İstanbul","Ankara","Ankara","Ankara","Antalya","Antalya","Antalya"]})
data

     Aylar  Sıcaklık  Şehirler
0  Haziran        30  İstanbul
1   Temmuz        34  İstanbul
2  Ağustos        35  İstanbul
3  Haziran        28    Ankara
4   Temmuz        32    Ankara
5  Ağustos        34    Ankara
6  Haziran        29   Antalya
7   Temmuz        35   Antalya
8  Ağustos        36   Antalya

In [196]:
data.pivot_table(index="Aylar",columns="Şehirler",values="Sıcaklık") #pivot tablo oluşturduk

Şehirler  Ankara  Antalya  İstanbul
Aylar
Ağustos       34       36        35
Haziran       28       29        30
Temmuz        32       35        34

In [197]:
#Aggregation Fonksiyonları
import pandas as pd
import numpy as np  
data=pd.DataFrame({"takımlar":["gs","fb","bjk","gs","fb","bjk"],
                  "attığıgoller":[188,192,176,194,190,189],
                  "yediğigoller":[70,76,68,82,70,60]})
data

  takımlar  attığıgoller  yediğigoller
0       gs           188            70
1       fb           192            76
2      bjk           176            68
3       gs           194            82
4       fb           190            70
5      bjk           189            60

In [198]:
data.groupby("takımlar").aggregate([min,np.median,max]) #takımlara göre grupladık ve min,median,max değerlerini aldık

         attığıgoller             yediğigoller
                  min median  max          min median max
takımlar
bjk               176  182.5  189           60   64.0  68
fb                190  191.0  192           70   73.0  76
gs                188  191.0  194           70   76.0  82

In [199]:
data.groupby("takımlar").aggregate({"attığıgoller":"max","yediğigoller":"min"})

          attığıgoller  yediğigoller
takımlar
bjk                189            60
fb                 192            70
gs                 194            70

In [200]:
def filter(a):
    return a["attığıgoller"].mean() > 190
data.groupby("takımlar").filter(filter) #takımlara göre grupladık ve attığıgollerin ortalaması 190 dan büyük olanları getirdik

  takımlar  attığıgoller  yediğigoller
0       gs           188            70
1       fb           192            76
3       gs           194            82
4       fb           190            70

In [201]:
data.groupby("takımlar").apply(np.sum) #takımlara göre grupladık ve toplamlarını aldık

         takımlar  attığıgoller  yediğigoller
takımlar
bjk        bjkbjk           365           128
fb           fbfb           382           146
gs           gsgs           382           152